{
    "activation_function": "silu",
    "architectures": [
      "LlamaCasualForLM"
    ],
    "attention_dropout": 0.0,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "model_type": "llama",
    "flashattention": false,
    "redux": false,
    "dtype": "fp32",
    "eos_token_id": 2,
    "bos_token_id": 1,
    "attention_bias": false,
    "rope_theta": 10000,
    "mlp_bias": false,
    "vocab_size": 32002,
    "hidden_size": 2048,
    "intermediate_size": 5504,
    "num_hidden_layers": 24,
    "num_attention_heads": 16,
    "num_key_value_heads": 16,
    "max_position_embeddings": 4096,
    "use_cache": true,
    "pretraining_tp": 1,
    "tie_word_embeddings": false,
    "rope_scaling": null
}
