{
    "vocab_size": 50257,
    "hidden_size": 1024,
    "num_layers": 12,
    "num_heads": 16,
    "intermediate_size": 4096,
    "hidden_dropout": 0.0,
    "attention_dropout": 0.0,
    "max_position_embeddings": 2048,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-5,
    "use_cache": false,
    "bos_token_id": 50256,
    "eos_token_id": 50256,
    "activation_function": "gelu_new",
    "model_type": "gpt_neo",
    "architectures": ["GPTNeoForCausalLM"],
    "attention_types": [[["global", "local"], 6]],
    "window_size": 256
}
