{
    "vocab_size": 50280,
    "hidden_size": 1024,
    "num_hidden_layers": 11,
    "num_attention_heads": 16,
    "intermediate_size": 4096,
    "hidden_dropout": 0.0,
    "attention_dropout": 0.0,
    "max_position_embeddings": 2048,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-5,
    "use_cache": false,
    "bos_token_id": 50256,
    "eos_token_id": 50256,
    "rotary_pct": 1.0,
    "rotary_emb_base": 10000,
    "use_parallel_residual": true,
    "activation_function": "gelu",
    "attention_bias": false,
    "model_type": "gpt_neox",
    "architectures": ["GPTNeoXForCausalLM"]
}
